Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FV16KM102.h
#define _CCP2CON3H_PSSACE0_POSITION              0x00000002
#define _CCP2CON3H_PSSACE0_MASK                  0x00000004
#define _CCP2CON3H_PSSACE0_LENGTH                0x00000001

#define _CCP2CON3H_PSSACE1_POSITION              0x00000003
#define _CCP2CON3H_PSSACE1_MASK                  0x00000008
#define _CCP2CON3H_PSSACE1_LENGTH                0x00000001

#define _CCP2CON3H_OSCNT0_POSITION               0x0000000C
#define _CCP2CON3H_OSCNT0_MASK                   0x00001000
#define _CCP2CON3H_OSCNT0_LENGTH                 0x00000001

#define _CCP2CON3H_OSCNT1_POSITION               0x0000000D
#define _CCP2CON3H_OSCNT1_MASK                   0x00002000
#define _CCP2CON3H_OSCNT1_LENGTH                 0x00000001

#define _CCP2CON3H_OSCNT2_POSITION               0x0000000E
#define _CCP2CON3H_OSCNT2_MASK                   0x00004000
#define _CCP2CON3H_OSCNT2_LENGTH                 0x00000001

#define _CCP2STAT_ICBNE_POSITION                 0x00000000
#define _CCP2STAT_ICBNE_MASK                     0x00000001
#define _CCP2STAT_ICBNE_LENGTH                   0x00000001

#define _CCP2STAT_ICOV_POSITION                  0x00000001
#define _CCP2STAT_ICOV_MASK                      0x00000002
#define _CCP2STAT_ICOV_LENGTH                    0x00000001

#define _CCP2STAT_ICDIS_POSITION                 0x00000002
#define _CCP2STAT_ICDIS_MASK                     0x00000004
#define _CCP2STAT_ICDIS_LENGTH                   0x00000001

#define _CCP2STAT_SCEVT_POSITION                 0x00000003
#define _CCP2STAT_SCEVT_MASK                     0x00000008
#define _CCP2STAT_SCEVT_LENGTH                   0x00000001

#define _CCP2STAT_ASEVT_POSITION                 0x00000004
#define _CCP2STAT_ASEVT_MASK                     0x00000010
#define _CCP2STAT_ASEVT_LENGTH                   0x00000001

#define _CCP2STAT_TRCLR_POSITION                 0x00000005
#define _CCP2STAT_TRCLR_MASK                     0x00000020
#define _CCP2STAT_TRCLR_LENGTH                   0x00000001

#define _CCP2STAT_TRSET_POSITION                 0x00000006
#define _CCP2STAT_TRSET_MASK                     0x00000040
#define _CCP2STAT_TRSET_LENGTH                   0x00000001

#define _CCP2STAT_CCPTRIG_POSITION               0x00000007
#define _CCP2STAT_CCPTRIG_MASK                   0x00000080
#define _CCP2STAT_CCPTRIG_LENGTH                 0x00000001

#define _CCP2STAT_ICGARM_POSITION                0x0000000A
#define _CCP2STAT_ICGARM_MASK                    0x00000400
#define _CCP2STAT_ICGARM_LENGTH                  0x00000001

#define _CCP2STAT_TRIG_POSITION                  0x00000007
#define _CCP2STAT_TRIG_MASK                      0x00000080
#define _CCP2STAT_TRIG_LENGTH                    0x00000001

#define _CCP2STATL_ICBNE_POSITION                0x00000000
#define _CCP2STATL_ICBNE_MASK                    0x00000001
#define _CCP2STATL_ICBNE_LENGTH                  0x00000001

#define _CCP2STATL_ICOV_POSITION                 0x00000001
#define _CCP2STATL_ICOV_MASK                     0x00000002
#define _CCP2STATL_ICOV_LENGTH                   0x00000001

#define _CCP2STATL_ICDIS_POSITION                0x00000002
#define _CCP2STATL_ICDIS_MASK                    0x00000004
#define _CCP2STATL_ICDIS_LENGTH                  0x00000001

#define _CCP2STATL_SCEVT_POSITION                0x00000003
#define _CCP2STATL_SCEVT_MASK                    0x00000008
#define _CCP2STATL_SCEVT_LENGTH                  0x00000001

#define _CCP2STATL_ASEVT_POSITION                0x00000004
#define _CCP2STATL_ASEVT_MASK                    0x00000010
#define _CCP2STATL_ASEVT_LENGTH                  0x00000001

#define _CCP2STATL_TRCLR_POSITION                0x00000005
#define _CCP2STATL_TRCLR_MASK                    0x00000020
#define _CCP2STATL_TRCLR_LENGTH                  0x00000001

#define _CCP2STATL_TRSET_POSITION                0x00000006
#define _CCP2STATL_TRSET_MASK                    0x00000040
#define _CCP2STATL_TRSET_LENGTH                  0x00000001

#define _CCP2STATL_CCPTRIG_POSITION              0x00000007
#define _CCP2STATL_CCPTRIG_MASK                  0x00000080
#define _CCP2STATL_CCPTRIG_LENGTH                0x00000001

#define _CCP2STATL_ICGARM_POSITION               0x0000000A
#define _CCP2STATL_ICGARM_MASK                   0x00000400
#define _CCP2STATL_ICGARM_LENGTH                 0x00000001

#define _CCP2STATL_TRIG_POSITION                 0x00000007
#define _CCP2STATL_TRIG_MASK                     0x00000080
#define _CCP2STATL_TRIG_LENGTH                   0x00000001

#define _SPI1BUF_SSPBUF_POSITION                 0x00000000
#define _SPI1BUF_SSPBUF_MASK                     0x000000FF
#define _SPI1BUF_SSPBUF_LENGTH                   0x00000008

#define _SPI1BUF_SPI1BUF_POSITION                0x00000000
#define _SPI1BUF_SPI1BUF_MASK                    0x000000FF
#define _SPI1BUF_SPI1BUF_LENGTH                  0x00000008

#define _SSP1BUF_SSPBUF_POSITION                 0x00000000
#define _SSP1BUF_SSPBUF_MASK                     0x000000FF
#define _SSP1BUF_SSPBUF_LENGTH                   0x00000008

#define _SSP1BUF_SPI1BUF_POSITION                0x00000000
#define _SSP1BUF_SPI1BUF_MASK                    0x000000FF
#define _SSP1BUF_SPI1BUF_LENGTH                  0x00000008

#define _SSP1CON1_SSPM_POSITION                  0x00000000
#define _SSP1CON1_SSPM_MASK                      0x0000000F
#define _SSP1CON1_SSPM_LENGTH                    0x00000004

#define _SSP1CON1_CKP_POSITION                   0x00000004
#define _SSP1CON1_CKP_MASK                       0x00000010
#define _SSP1CON1_CKP_LENGTH                     0x00000001

#define _SSP1CON1_SSPEN_POSITION                 0x00000005
#define _SSP1CON1_SSPEN_MASK                     0x00000020
#define _SSP1CON1_SSPEN_LENGTH                   0x00000001

#define _SSP1CON1_SSPOV_POSITION                 0x00000006
#define _SSP1CON1_SSPOV_MASK                     0x00000040
#define _SSP1CON1_SSPOV_LENGTH                   0x00000001

#define _SSP1CON1_WCOL_POSITION                  0x00000007
#define _SSP1CON1_WCOL_MASK                      0x00000080
#define _SSP1CON1_WCOL_LENGTH                    0x00000001

#define _SSP1CON1_SSPM0_POSITION                 0x00000000
#define _SSP1CON1_SSPM0_MASK                     0x00000001
#define _SSP1CON1_SSPM0_LENGTH                   0x00000001

